# Manipulando dados

In [1]:
#Importando os pacores
import pandas as pd
import numpy as np

In [2]:
#acessando o help dos pacores
pd?

## Dicionarios

In [3]:
#Criando um dicionário com os dados
dados = {'canal_vendas': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300, 400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [4]:
#Para printar o dicionário
dados

{'canal_vendas': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#Verificando o tipo do dicionário
type(dados)

dict

In [6]:
#Acessando as chaves do meu dicionário
dados.keys()

dict_keys(['canal_vendas', 'acessos', 'site', 'vendas'])

In [7]:
#Acessando uma chave especifica
dados['canal_vendas']

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [8]:
#Acessando uma posição especifica de um dicionário
dados['canal_vendas'][2]

'instagram'

In [9]:
#Acessando uma posição especifica de um dicionario
dados['canal_vendas'][:2]

['facebook', 'twitter']

## Listas

In [10]:
#Criando uma lista
lista = [200, 200, 300, 800, 200]

In [11]:
#Printando a lista
lista

[200, 200, 300, 800, 200]

In [12]:
#Vendo valores específicos
lista[1]

200

In [13]:
#Fatia da lista
lista[:3]

[200, 200, 300]

In [14]:
#Verificando o tipo
type(lista)

list

In [15]:
#Adicionando a lista ao dicionario
dados['lista'] = lista

In [16]:
dados

{'canal_vendas': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

## DataFrame

In [17]:
#Criando um data frame a partir de um dict
dataframe = pd.DataFrame(dados)

In [18]:
#Acessando o dataframe
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3     linkedin      400  site2  5000.00    800
4     facebook      500  site3   300.00    200

In [19]:
#Printando os primeiros casos do dataframe
dataframe.head(1)

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200

In [20]:
pd

In [21]:
#Verificando o formato do dataframe
dataframe.shape

(5, 5)

In [22]:
#Verificando o indice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [23]:
#Verificando os tipos dos dados do dataframe
dataframe.dtypes

canal_vendas     object
acessos           int64
site             object
vendas          float64
lista             int64
dtype: object

In [24]:
#Verificando se existem valores faltantes
dataframe.isna()

   canal_vendas  acessos   site  vendas  lista
0         False    False  False   False  False
1         False    False  False   False  False
2         False    False  False   False  False
3         False    False  False   False  False
4         False    False  False   False  False

In [25]:
#Printando os nomes das colunas
dataframe.columns

Index(['canal_vendas', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [26]:
#Acessando uma coluna especifica
dataframe['canal_vendas']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_vendas, dtype: object

In [27]:
#Criando uma nova coluna
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [28]:
dataframe

  canal_vendas  acessos   site   vendas  lista  nova_coluna
0     facebook      100  site1  1000.52    200            1
1      twitter      200  site1  1052.34    200            2
2    instagram      300  site2  2002.00    300            3
3     linkedin      400  site2  5000.00    800            4
4     facebook      500  site3   300.00    200            5

In [29]:
dataframe.columns

Index(['canal_vendas', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [30]:
#Removendo colunas
dataframe.drop(columns = 'nova_coluna', inplace = True)

In [31]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3     linkedin      400  site2  5000.00    800
4     facebook      500  site3   300.00    200

In [32]:
#Removendo colunas
dataframe.drop(columns = ['acessos', 'site'])

  canal_vendas   vendas  lista
0     facebook  1000.52    200
1      twitter  1052.34    200
2    instagram  2002.00    300
3     linkedin  5000.00    800
4     facebook   300.00    200

In [33]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3     linkedin      400  site2  5000.00    800
4     facebook      500  site3   300.00    200

In [34]:
#Mostrando as colunas
dataframe.columns

Index(['canal_vendas', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [35]:
#Acessando valores especificos
dataframe['canal_vendas'][1]

'twitter'

In [36]:
#Acessando fatia de colunas especificas
dataframe['canal_vendas'][:2]

0    facebook
1     twitter
Name: canal_vendas, dtype: object

In [37]:
#Fatiando os dados usando iloc (linhas | colunas)
dataframe.iloc[:2,2:]

    site   vendas  lista
0  site1  1000.52    200
1  site1  1052.34    200

In [38]:
#Fatiar os dados usando o loc (indice)
dataframe.loc[:3]

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3     linkedin      400  site2  5000.00    800

In [39]:
#Selecionando colunas especificas
dataframe[['canal_vendas', 'acessos']]

  canal_vendas  acessos
0     facebook      100
1      twitter      200
2    instagram      300
3     linkedin      400
4     facebook      500

In [40]:
#Passando os valores atraves de lista
filtro = ['canal_vendas', 'acessos']

In [41]:
dataframe[filtro]

  canal_vendas  acessos
0     facebook      100
1      twitter      200
2    instagram      300
3     linkedin      400
4     facebook      500

In [42]:
#Usando o metodo info()
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   canal_vendas  5 non-null      object
 1   acessos       5 non-null      int64
 2   site          5 non-null      object
 3   vendas        5 non-null      float64
 4   lista         5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 224.0+ bytes

In [43]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3     linkedin      400  site2  5000.00    800
4     facebook      500  site3   300.00    200

In [44]:
#Pivotando os dados (colunas)
dataframe.pivot(index = 'canal_vendas', columns = 'site', values = 'acessos')

site          site1  site2  site3
canal_vendas
facebook      100.0    NaN  500.0
instagram       NaN  300.0    NaN
linkedin        NaN  400.0    NaN
twitter       200.0    NaN    NaN

In [45]:
#Completando os valores faltantes usando fillna
#Pivotando os dados (coluna)
aux = dataframe.pivot(index = 'canal_vendas', columns = 'site', values = 'acessos').fillna(0)
aux

site          site1  site2  site3
canal_vendas
facebook      100.0    0.0  500.0
instagram       0.0  300.0    0.0
linkedin        0.0  400.0    0.0
twitter       200.0    0.0    0.0

In [46]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3     linkedin      400  site2  5000.00    800
4     facebook      500  site3   300.00    200

In [47]:
#Mudando as colunas usando o comando melt
dataframe.melt(id_vars = 'site', value_vars = 'canal_vendas')

    site      variable      value
0  site1  canal_vendas   facebook
1  site1  canal_vendas    twitter
2  site2  canal_vendas  instagram
3  site2  canal_vendas   linkedin
4  site3  canal_vendas   facebook

In [48]:
#Resetando o indice do dataframe
print(aux.columns)
aux = aux.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['canal_vendas', 'site1', 'site2', 'site3'], dtype='object', name='site')

In [49]:
aux

site canal_vendas  site1  site2  site3
0        facebook  100.0    0.0  500.0
1       instagram    0.0  300.0    0.0
2        linkedin    0.0  400.0    0.0
3         twitter  200.0    0.0    0.0

In [50]:
#Exemplo do comando melt
aux.melt(id_vars = 'canal_vendas', value_vars = ['site1', 'site2', 'site3'])

   canal_vendas   site  value
0      facebook  site1  100.0
1     instagram  site1    0.0
2      linkedin  site1    0.0
3       twitter  site1  200.0
4      facebook  site2    0.0
5     instagram  site2  300.0
6      linkedin  site2  400.0
7       twitter  site2    0.0
8      facebook  site3  500.0
9     instagram  site3    0.0
10     linkedin  site3    0.0
11      twitter  site3    0.0

In [51]:
#Somando as colunas do dataframe
dataframe.sum()

canal_vendas    facebooktwitterinstagramlinkedinfacebook
acessos                                             1500
site                           site1site1site2site2site3
vendas                                           9354.86
lista                                               1700
dtype: object

In [52]:
#Somando as linhas do dataframe
dataframe.sum(axis = 1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [53]:
#Calculando a mediana das colunas numericas
print('Por linha', dataframe.median(axis = 1))
print('\n')
print('Por coluna', dataframe.median())

Por linha 0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64


Por coluna acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [54]:
#Calculando a media das colunas númericas
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [55]:
#Calculando o desvio padrao das colunas numericas
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [56]:
#Usando o comando describe que calcula estatisticas descritivas para colunas numericas
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [57]:
#Calculando a moda
dataframe.mode()

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1   300.00  200.0
1          NaN      200  site2  1000.52    NaN
2          NaN      300    NaN  1052.34    NaN
3          NaN      400    NaN  2002.00    NaN
4          NaN      500    NaN  5000.00    NaN

In [58]:
#Valores maximo por colunas
dataframe.max()

canal_vendas    twitter
acessos             500
site              site3
vendas             5000
lista               800
dtype: object

In [59]:
#Valor minimo por coluna
dataframe.min()

canal_vendas    facebook
acessos              100
site               site1
vendas               300
lista                200
dtype: object

In [60]:
#Printando o numero de unicos
dataframe.nunique()

canal_vendas    4
acessos         5
site            3
vendas          5
lista           3
dtype: int64

In [61]:
#Contando valores unicos de uma coluna
dataframe['canal_vendas'].value_counts()

facebook     2
twitter      1
linkedin     1
instagram    1
Name: canal_vendas, dtype: int64

In [62]:
#Valores unicos de uma coluna
dataframe['canal_vendas'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [63]:
#Usando o groupby com valores numericos
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [64]:
#Usando groupby com valores numericos
dataframe.groupby('site')['acessos'].mean()

site
site1    150
site2    350
site3    500
Name: acessos, dtype: int64

In [65]:
#Usando o groupby com valores categoricos
dataframe.groupby('site')['canal_vendas'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_vendas, dtype: object

In [66]:
#Usando groupby com categoricos
dataframe.groupby('site')['canal_vendas'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_vendas, dtype: object

In [67]:
#Usando groupby com funcao agg
dataframe.groupby('canal_vendas').agg({'site': 'unique',
                                       'acessos': 'sum'})

                        site  acessos
canal_vendas
facebook      [site1, site3]      600
instagram            [site2]      300
linkedin             [site2]      400
twitter              [site1]      200

In [68]:
#Correlação entre variaveis
dataframe.corr()

          acessos    vendas     lista
acessos  1.000000  0.217542  0.363803
vendas   0.217542  1.000000  0.979211
lista    0.363803  0.979211  1.000000

In [69]:
#Criando variaveis categoricas por fatia de variavel numerica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                      bins = (0, 1500, 2000, 8000),
                                      labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [70]:
dataframe

  canal_vendas  acessos   site   vendas  lista categoria_vendas
0     facebook      100  site1  1000.52    200         0 a 1500
1      twitter      200  site1  1052.34    200         0 a 1500
2    instagram      300  site2  2002.00    300      2000 a 8000
3     linkedin      400  site2  5000.00    800      2000 a 8000
4     facebook      500  site3   300.00    200         0 a 1500

In [71]:
#Criando variavel categorica usando compressao de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [72]:
dataframe

,canal_vendas,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

In [73]:
# Juntando dois dataframes | Criando o dataframe2
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
                           'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [74]:
# Realizando o merge
dataframe.merge(dataframe_2, on = 'site', how = 'left')

,canal_vendas,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,0 a 1500,maior_que_300,Ezequiel

In [75]:
# Salvando o dataframe como csv
dataframe.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)

In [76]:
# Lendo dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [77]:
dataframe_lido.head()

,canal_vendas,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

# Imputação de dados

In [92]:
df = pd.read_csv('data-sets/train.csv')

In [80]:
# Criando um novo dataframe a partir do df lido com as colunas e seus respectivos tipos e percentual de dados faltantes
aux = pd.DataFrame({'colunas': df.columns,
                   'tipos': df.dtypes,
                   'percentual_faltante': df.isna().sum() / df.shape[0]})

In [81]:
aux

                 colunas    tipos  percentual_faltante
PassengerId  PassengerId    int64             0.000000
Survived        Survived    int64             0.000000
Pclass            Pclass    int64             0.000000
Name                Name   object             0.000000
Sex                  Sex   object             0.000000
Age                  Age  float64             0.198653
SibSp              SibSp    int64             0.000000
Parch              Parch    int64             0.000000
Ticket            Ticket   object             0.000000
Fare                Fare  float64             0.000000
Cabin              Cabin   object             0.771044
Embarked        Embarked   object             0.002245

In [82]:
# Substituindo valores na para dados númericos - mais comuns para serem usados média ou mediana
# Substituindo os valores na da coluna age pela média dos valores dessa coluna
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [84]:
# Substituindo valores na para dados categoricos: Unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [86]:
df['Cabin'].value_counts()

Unknown        687
B96 B98          4
C23 C25 C27      4
G6               4
D                3
              ...
A19              1
A20              1
C54              1
B4               1
C106             1
Name: Cabin, Length: 148, dtype: int64

In [89]:
df['Cabin'].head(30)

0         Unknown
1             C85
2         Unknown
3            C123
4         Unknown
5         Unknown
6             E46
7         Unknown
8         Unknown
9         Unknown
10             G6
11           C103
12        Unknown
13        Unknown
14        Unknown
15        Unknown
16        Unknown
17        Unknown
18        Unknown
19        Unknown
20        Unknown
21            D56
22        Unknown
23             A6
24        Unknown
25        Unknown
26        Unknown
27    C23 C25 C27
28        Unknown
29        Unknown
Name: Cabin, dtype: object